#### Q1. List any five functions of the pandas library with execution.

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

#### Q6. Which function of pandas do we use to read an excel file?

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
#### Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
#### The function should return a new DataFrame that contains only the selected rows.

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
#### Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
#### Your function should create the following DataFrame:

#### Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
#### The function should return the modified DataFrame.

####  Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

# Answers

### Q1. List any five functions of the pandas library with execution.

In [20]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice'],
    'Age': [25, 30, 22, 28, 24],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'New York']
}

df = pd.DataFrame(data)

#### 1. df.groupby() : 
This function is used to group the DataFrame based on a specific column and perform aggregate operations.

In [2]:
average_age_by_city = df.groupby('City')['Age'].mean()

In [3]:
average_age_by_city

City
London      30.0
New York    24.5
Paris       22.0
Tokyo       28.0
Name: Age, dtype: float64

#### 2. df.sort_values() : 
This function is used to sort the DataFrame based on one or more columns.

In [4]:
sorted_df = df.sort_values(by='Age', ascending=False)
sorted_df

      Name  Age      City
1      Bob   30    London
3    David   28     Tokyo
0    Alice   25  New York
4    Alice   24  New York
2  Charlie   22     Paris

#### 4. df.pivot_table() :
This function is used to create a pivot table from the DataFrame.

In [5]:
pivot_table = df.pivot_table(values='Age', index='City', aggfunc='mean')

In [6]:
pivot_table

           Age
City
London    30.0
New York  24.5
Paris     22.0
Tokyo     28.0

#### 5. df.describe() : 
Generates descriptive statistics of the DataFrame's numerical columns.

In [8]:
df.describe()

             Age
count   5.000000
mean   25.800000
std     3.193744
min    22.000000
25%    24.000000
50%    25.000000
75%    28.000000
max    30.000000

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [10]:
data1 = {
    'A': ['Alice', 'Bob', 'Charlie', 'David', 'Alice'],
    'B': [25, 30, 22, 28, 24],
    'C': ['New York', 'London', 'Paris', 'Tokyo', 'New York']
}

df1 = pd.DataFrame(data1)

In [11]:
df1

         A   B         C
0    Alice  25  New York
1      Bob  30    London
2  Charlie  22     Paris
3    David  28     Tokyo
4    Alice  24  New York

In [14]:
df1.reset_index()[1::2]

   index      A   B       C
1      1    Bob  30  London
3      3  David  28   Tokyo

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [16]:
data2={"Values":[10,20,30,40,50]}
df2=pd.DataFrame(data2)
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [21]:
df2["Values"][0:3].sum()

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [25]:
data3={"Text":["My Name is Madhusudan Prajapati","I have completed My graduation in Computer Science and information technology","My dream is become a good data Scientist"]}

In [26]:
df3=pd.DataFrame(data3)
df3

                                                Text
0                    My Name is Madhusudan Prajapati
1  I have completed My graduation in Computer Sci...
2           My dream is become a good data Scientist

In [39]:
def cout_word(x):
    return len(x.split(" "))

In [37]:
df3['Word_Count']=df3[["Text"]].applymap(cout_word)

In [38]:
df3

                                                Text  Word_Count
0                    My Name is Madhusudan Prajapati           5
1  I have completed My graduation in Computer Sci...          11
2           My dream is become a good data Scientist           8

### Q5. How are DataFrame.size() and DataFrame.shape() different?

#### 1. DataFrame.size :
returns the total number of elements in the DataFrame, which is the product of the number of rows and the number of columns. It represents the total count of values in the DataFrame, regardless of their uniqueness.

In [40]:
data4 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

df4 = pd.DataFrame(data4)

In [41]:
print(df4.size)  # Output: 9 (3 rows * 3 columns = 9 elements)

9

#### 2. DataFrame.shape :
returns a tuple representing the dimensions of the DataFrame. It returns the number of rows and the number of columns as (rows, columns). It gives the structural information about the DataFrame.

In [44]:
df4.shape

(3, 3)

### Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel("file Name")

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [45]:
data5={"Email":["john.doe@example.com","madhu.prajapati@gmail.com","rajat.singh@gmail.com"]}
df5=pd.DataFrame(data5)
df5

                       Email
0       john.doe@example.com
1  madhu.prajapati@gmail.com
2      rajat.singh@gmail.com

In [78]:
import re
def user(x):
    l=re.split("@",x)
    result=''
    for i in l:
        if re.search("com$",i)==None:
            result=i
    return result

In [83]:
def str(x):
    l=re.split("@",x)[0]
    return l

In [79]:
df5['Username']=df5[["Email"]].applymap(user)

In [80]:
df5

                       Email         Username
0       john.doe@example.com         john.doe
1  madhu.prajapati@gmail.com  madhu.prajapati
2      rajat.singh@gmail.com      rajat.singh

In [87]:
df5['Username_1']=df5[["Email"]].applymap(str)

In [88]:
df5

                       Email         Username       Username_1
0       john.doe@example.com         john.doe         john.doe
1  madhu.prajapati@gmail.com  madhu.prajapati  madhu.prajapati
2      rajat.singh@gmail.com      rajat.singh      rajat.singh

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.For example, if df contains the following values:

In [89]:
data6={"A":[3,8,6,2,9],
       "B":[5,2,9,3,1],
       "C":[1,7,4,5,2]
      }
df6=pd.DataFrame(data6)
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [116]:
def row(df6):
    result=df6[(df6["A"]>5) & (df6["B"]<10)]
    return result

In [117]:
new_df=row(df6)
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [122]:
data7={"Values":[1,4,4,6,20,40,90]}
df7=pd.DataFrame(data7)
df7

   Values
0       1
1       4
2       4
3       6
4      20
5      40
6      90

In [123]:
df7[["Values"]].mean()

Values    23.571429
dtype: float64

In [124]:
df7[["Values"]].median()

Values    6.0
dtype: float64

In [125]:
df7[["Values"]].mode()

   Values
0       4

In [126]:
df7[["Values"]].std()

Values    32.351492
dtype: float64

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [128]:
data8={"Sales":[100,200,400,1000,30,10,500,400,600,900],
       "Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05","2023-01-06","2023-01-07","2023-01-08",
              "2023-01-09","2023-01-10"]}
df8=pd.DataFrame(data8)
df8

   Sales        Date
0    100  2023-01-01
1    200  2023-01-02
2    400  2023-01-03
3   1000  2023-01-04
4     30  2023-01-05
5     10  2023-01-06
6    500  2023-01-07
7    400  2023-01-08
8    600  2023-01-09
9    900  2023-01-10

In [131]:
df8['MovingAverage']=df8[["Sales"]].rolling(window=7).mean()

In [132]:
df8

   Sales        Date  MovingAverage
0    100  2023-01-01            NaN
1    200  2023-01-02            NaN
2    400  2023-01-03            NaN
3   1000  2023-01-04            NaN
4     30  2023-01-05            NaN
5     10  2023-01-06            NaN
6    500  2023-01-07     320.000000
7    400  2023-01-08     362.857143
8    600  2023-01-09     420.000000
9    900  2023-01-10     491.428571

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
Date
0 2023-01-01 1 2023-01-02 2 2023-01-03 3 2023-01-04 4 2023-01-05

Your function should create the following DataFrame:
Date Weekday
0 2023-01-01 Sunday 1 2023-01-02 Monday 2 2023-01-03 Tuesday 3 2023-01-04 Wednesday 4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [133]:
data9={"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]}
df9=pd.DataFrame(data9)
df9

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [139]:
df9['Date']=pd.to_datetime(df9['Date'])

In [147]:
df9["Weekday"]=df9["Date"].dt.day_name()

In [148]:
df9

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [151]:
start='2023-01-01'
end='2023-01-03'

result_date=df9[(df9["Date"]>=start) & (df9["Date"]<=end)]
result_date

        Date  Weekday
0 2023-01-01   Sunday
1 2023-01-02   Monday
2 2023-01-03  Tuesday

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [152]:
import pandas as pd